---
kind: property
id: P:Autodesk.Revit.DB.ElementFilter.IsValidObject
source: html/027ccc75-b7f6-4ee2-cf98-563df96b0dbb.htm
---
# Autodesk.Revit.DB.ElementFilter.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.